Repository: maqa588/Strophe
Catalog: Strophe/App/Localizable.xcstrings
Source language: en
Languages: ar, ja, ko, zh_hans, zh_hant

source: Set as default new group
ar: تعيين كمجموعة افتراضية جديدة
ja: デフォルトの新規グループに設定
ko: 기본 새 그룹으로 설정
zh_hans: 设为默认新建组
zh_hant: 設為預設新建組

source: Set Style
ar: تعيين النمط
ja: スタイルを設定
ko: 스타일 설정
zh_hans: 设定样式
zh_hant: 設定樣式

source: Set subtitle style
ar: إعداد نمط الترجمة
ja: 字幕スタイルを設定
ko: 자막 스타일 설정
zh_hans: 设置字幕样式
zh_hant: 設置字幕樣式

source: Set subtitle text color
ar: إعداد لون نص الترجمة
ja: 字幕テキストの色を設定
ko: 자막 텍스트 색상 설정
zh_hans: 设置字幕文字颜色
zh_hant: 設置字幕文字顏色

source: Settings
ar: الإعدادات
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設定

# show_safe_areas_explanation
source: Show EBU R95 / ITU-R BT.1848 Action Safe (3.5%) & Title Safe (5%)
ar: إظهار المنطقة الآمنة للعمل (3.5٪) والمنطقة الآمنة للعنوان (5٪) وفقًا لمعيار EBU R95 / ITU-R BT.1848
ja: EBU R95 / ITU-R BT.1848 アクションセーフ（3.5%）＆タイトルセーフ（5%）を表示
ko: EBU R95 / ITU-R BT.1848 액션 세이프(3.5%) 및 타이틀 세이프(5%) 표시
zh_hans: 显示 EBU R95 / ITU-R BT.1848 动作安全区（3.5%）与图文安全区（5%）
zh_hant: 顯示 EBU R95 / ITU-R BT.1848 動作安全區（3.5%）與圖文安全區（5%）

source: Show subtitles of this group
ar: إظهار ترجمات هذه المجموعة
ja: このグループの字幕を表示
ko: 이 그룹의 자막 표시
zh_hans: 显示此组字幕
zh_hant: 顯示此組字幕

source: Show This Group
ar: إظهار هذه المجموعة
ja: このグループを表示
ko: 이 그룹 표시
zh_hans: 显示此组
zh_hant: 顯示此組

source: Show transparent checkerboard background
ar: إظهار خلفية لوحة الشطرنج الشفافة
ja: 透明なチェッカーボード背景を表示
ko: 투명 체크판 배경 표시
zh_hans: 显示透明棋盘背景
zh_hant: 顯示透明棋盤背景

source: Simplified Chinese
ar: الصينية المبسطة
ja: 簡体字中国語
ko: 간체 중국어
zh_hans: 简中
zh_hant: 簡中

# single_line_char_limit
source: Single Line Character Limit
ar: حد أحرف السطر الواحد
ja: 1行文字数制限
ko: 한 줄 글자 수 제한
zh_hans: 单行字符长度
zh_hant: 單行字元長度

source: Slap Create
ar: إنشاء بالضرب
ja: 打鍵作成
ko: 비트 생성
zh_hans: 拍打创建
zh_hant: 拍打建立

source: Slap Finalize
ar: إنهاء الضرب
ja: 打鍵確定
ko: 비트 확정
zh_hans: 拍打结算
zh_hant: 拍打結算

source: Slap J Key
ar: توقيت بمفتاح J
ja: Jキー打鍵
ko: J 키 비트
zh_hans: J 键打轴
zh_hant: J 鍵打軸

source: Slap K Key
ar: توقيت بمفتاح K
ja: Kキー打鍵
ko: K 키 비트
zh_hans: K 键打轴
zh_hant: K 鍵打軸

source: Smart Audio/Video Subtitle Sync Tool
ar: أداة ذكية لمزامنة ترجمة الصوت والفيديو
ja: スマート音声・ビデオ字幕同期ツール
ko: 스마트 오디오/비디오 자막 동기화 도구
zh_hans: 智能音视频字幕同步工具
zh_hant: 智能音視頻字幕同步工具

source: Smart Noise Reduction
ar: تقليل الضوضاء الذكي
ja: スマートノイズ低減
ko: 스마트 노이즈 감소
zh_hans: 智能降噪
zh_hant: 智能降噪

source: Smart Noise Reduction & Auxiliary Settings
ar: تقليل الضوضاء الذكي والإعدادات المساعدة
ja: スマートノイズ低減と補助設定
ko: 스마트 노이즈 감소 및 보조 설정
zh_hans: 智能降噪与辅助设置
zh_hant: 智能降噪與輔助設定

source: Soft Subtitle Preview
ar: معاينة الترجمة البرمجية
ja: ソフト字幕プレビュー
ko: 소프트 자막 미리보기
zh_hans: 软字幕预览
zh_hant: 軟字幕預覽

# some_models_belong_to_restricted
source: Some models belong to restricted repositories and require a Hugging Face access token to download. You can obtain one from huggingface.co/settings/tokens.
ar: بعض النماذج تنتمي إلى مستودعات مقيدة وتتطلب رمز وصول Hugging Face للتنزيل. يمكن الحصول عليه بالانتقال إلى huggingface.co/settings/tokens.
ja: 一部のモデルは制限付きリポジトリに属しており、ダウンロードするには Hugging Face アクセストークンが必要です。huggingface.co/settings/tokens から取得できます。
ko: 일부 모델은 제한된 저장소에 속해 있어 다운로드하려면 Hugging Face 액세스 토큰이 필요합니다. huggingface.co/settings/tokens에서 얻을 수 있습니다.
zh_hans: 部分模型属于受限仓库，需要 Hugging Face 访问令牌才能下载。可前往 huggingface.co/settings/tokens 获取。
zh_hant: 部分模型屬於受限倉庫，需要 Hugging Face 存取權杖才能下載。可前往 huggingface.co/settings/tokens 獲取。

source: Source Language
ar: اللغة المصدر
ja: 元の言語
ko: 소스 언어
zh_hans: 原语言
zh_hant: 原語言

source: Speaker Diarization
ar: التعرف على المتحدث
ja: 話者認識
ko: 화자 인식
zh_hans: 对话人识别
zh_hant: 對話人識別

# speaker_diarization_aligner_explanation
source: Diarization still calls aligner for word-level timestamps, but won't refine timeline.
ar: لا يزال تحديد المتحدث يستدعي المحاذي لطوابع زمنية على مستوى الكلمة، ولكن لن يتم تحسين الخط الزمني.
ja: 話者分離は依然としてワードレベルのタイムスタンプのためにアライナーを呼び出しますが、タイムラインの調整は行いません。
ko: 화자 분할은 단어 수준 타임스탬프를 위해 정렬기를 호출하지만 타임라인을 정밀 조정하지는 않습니다.
zh_hans: 对话人识别仍会调用对齐器生成词级时间戳，但不会额外做时间轴精修。
zh_hant: 對話人識別仍會呼叫對齊器生成詞級時間戳記，但不會額外做時間軸精修。

source: Speaker Diarization (Pyannote)
ar: التعرف على المتحدث (Pyannote)
ja: 話者認識 (Pyannote)
ko: 화자 인식 (Pyannote)
zh_hans: 对话人识别 (Pyannote)
zh_hant: 對話人識別 (Pyannote)

source: Speaker Diarization Settings
ar: إعدادات التعرف على المتحدث
ja: 話者認識設定
ko: 화자 인식 설정
zh_hans: 对话人识别设置
zh_hant: 對話人識別設定

source: Specify number of people
ar: تحديد عدد الأشخاص
ja: 人数を指定
ko: 인원 수 지정
zh_hans: 指定人数
zh_hant: 指定人數

source: Speech Recognition
ar: التعرف على الكلام
ja: 音声認識
ko: 음성 인식
zh_hans: 语音识别
zh_hant: 語音識別

# speech_recognition_1
source: Speech Recognition…
ar: التعرف على الكلام…
ja: 音声認識…
ko: 음성 인식…
zh_hans: 语音识别…
zh_hant: 語音識別…

# speech_recognition_2
source: Speech Recognition
ar: التعرف على الكلام
ja: 音声認識
ko: 음성 인식
zh_hans: 语音识别
zh_hant: 語音識別

source: Speech Recognition Config (Qwen3-ASR)
ar: تكوين التعرف على الكلام (Qwen3-ASR)
ja: 音声認識構成 (Qwen3-ASR)
ko: 음성 인식 구성 (Qwen3-ASR)
zh_hans: 语音识别配置 (Qwen3-ASR)
zh_hant: 語音識別配置 (Qwen3-ASR)

source: Speech Transcription Settings
ar: إعدادات تحويل الكلام إلى نص
ja: 音声文字起こし設定
ko: 음성 전사 설정
zh_hans: 语音转写设置
zh_hant: 語音轉寫設定

source: Speed / Size
ar: السرعة / الحجم
ja: 速度 / サイズ
ko: 속도 / 크기
zh_hans: 速度 / 体积
zh_hant: 速度 / 體積

source: Split Subtitles
ar: تقسيم الترجمة
ja: 字幕分割
ko: 자막 분할
zh_hans: 切分字幕
zh_hant: 切分字幕

source: Start
ar: ابدأ
ja: 開始
ko: 시작
zh_hans: 开始
zh_hant: 開始

source: Start from Blank Timeline
ar: البدء من خط زمني فارغ
ja: 空白のタイムラインから開始
ko: 빈 템플릿으로 시작
zh_hans: 从空白时间轴开始
zh_hant: 從空白時間軸開始

source: Start Generating
ar: بدء التوليد
ja: 生成開始
ko: 생성 시작
zh_hans: 开始生成
zh_hant: 開始生成

source: Start time, e.g., 01:23.45
ar: وقت البداية، مثل 01:23.45
ja: 開始時間、例：01:23.45
ko: 시작 시간, 예: 01:23.45
zh_hans: 起始时间，例如 01:23.45
zh_hant: 起始時間，例如 01:23.45

source: Start Translation
ar: بدء الترجمة
ja: 翻訳を開始
ko: 번역 시작
zh_hans: 开始翻译
zh_hant: 開始翻譯

source: Start Translation from Here
ar: بدء الترجمة من هنا
ja: ここから翻訳を開始
ko: 여기서부터 번역 시작
zh_hans: 从这里开始翻译
zh_hant: 從這裡開始翻譯

source: Storage
ar: تخزين
ja: ストレージ
ko: 저장소
zh_hans: 存储
zh_hant: 儲存

source: Storage & Maintenance
ar: التخزين والصيانة
ja: ストレージとメンテナンス
ko: 스토리지 및 유지 관리
zh_hans: 存储与维护
zh_hant: 儲存與維護

source: Strikethrough
ar: يتوسطه خط
ja: 取り消し線
ko: 취소선
zh_hans: 删除线
zh_hant: 刪除線

# strophe_is_committed_to_providing
source: Strophe is committed to providing video creators with the smoothest and most efficient timing and subtitle import/export workflow. Through shortcut operations that perfectly fit creators' habits and precise audio waveform display, we are redefining the subtitle production experience.
ar: تلتزم Strophe بتقديم أسلس وأكثر عمليات توقيت واستيراد/تصدير الترجمة كفاءة لصانعي الفيديو. من خلال عمليات مفاتيح الاختصار المتوافقة للغاية مع عادات المبدعين وعرض شكل الموجة الصوتية الدقيق، نقوم بإعادة تعريف تجربة إنتاج الترجمة.
ja: Stropheは、映像クリエイターに最もスムーズで効率的なタイミング調整と字幕のインポート/エクスポートワークフローを提供することに尽力しています。クリエイターの習慣に極めて適合したショートカットキー操作と微細な音声波形表示により、字幕制作体験を再定義しています。
ko: Strophe는 비디오 크리에이터에게 가장 원활하고 효율적인 타이밍 및 자막 가져오기/내보내기 워크플로우를 제공하기 위해 최선을 다하고 있습니다. 크리에이터의 습관에 완벽하게 부합하는 단축키 조작과 정밀한 오디오 파형 표시를 통해 자막 제작 환경을 재정의하고 있습니다.
zh_hans: Strophe 致力于为视频创作者提供最流畅、最高效的打轴与字幕导入/导出流程。通过极其贴合创作者习惯的快捷键操作与精细的音频波形显示，我们正在重新定义字幕制作体验。
zh_hant: Strophe 致力於為影片創作者提供最流暢、最高效的打軸與字幕匯入/導出流程。透過極其貼合創作者習慣的快捷鍵操作與精細的音訊波形顯示，我們正在重新定義字幕製作體驗。

source: Strophe Project (.strophe)
ar: مشروع Strophe (.strophe)
ja: Strophe プロジェクト (.strophe)
ko: Strophe 프로젝트 (.strophe)
zh_hans: Strophe 工程 (.strophe)
zh_hant: Strophe 工程 (.strophe)

source: Style
ar: النمط
ja: スタイル
ko: 스타일
zh_hans: 样式
zh_hant: 樣式

# style_description_eg_58_pt
source: Style description, e.g., 58 pt, PingFang SC
ar: وصف النمط، على سبيل المثال: 58 pt, PingFang SC
ja: スタイル説明、例：58 pt, PingFang SC
ko: 스타일 설명, 예: 58 pt, PingFang SC
zh_hans: 样式描述，例如：58 pt,平方-简
zh_hant: 樣式描述，例如：58 pt,平方-簡

source: Style Name
ar: اسم النمط
ja: スタイル名
ko: 스타일 이름
zh_hans: 样式名称
zh_hant: 樣式名稱

source: Style Operations
ar: عمليات النمط
ja: スタイル操作
ko: 스타일 작업
zh_hans: 样式操作
zh_hant: 樣式操作

source: Style Properties
ar: خصائص النمط
ja: スタイル属性
ko: 스타일 속성
zh_hans: 样式属性
zh_hant: 樣式屬性

source: Submission Language
ar: لغة التقديم
ja: 提出言語
ko: 제출 언어
zh_hans: 提交语言
zh_hant: 提交語言

source: Subtitle
ar: عنوان فرعي
ja: サブタイトル
ko: 자막
zh_hans: 子标题
zh_hant: 子標題

source: Subtitle Block Operations
ar: عمليات كتلة الترجمة
ja: 字幕ブロック操作
ko: 자막 블록 작업
zh_hans: 字幕块操作
zh_hant: 字幕塊操作

source: Subtitle Count
ar: عدد الترجمات
ja: 字幕数
ko: 자막 개수
zh_hans: 字幕数量
zh_hant: 字幕數量

source: Subtitle, e.g., Default Group
ar: العنوان الفرعي، مثل: المجموعة الافتراضية
ja: サブタイトル、例：デフォルトグループ
ko: 자막, 예: 기본 그룹
zh_hans: 子标题，例如：默认分组
zh_hant: 子標題，例如：預設分組

source: Subtitle Mode
ar: وضع الترجمة
ja: 字幕モード
ko: 자막 모드
zh_hans: 字幕模式
zh_hant: 字幕模式

source: Subtitle Timing, Transcription & Calibration
ar: مزامنة الترجمة وكتابتها ومعايرتها
ja: 字幕タイミング・書き起こし・校正
ko: 자막 싱크, 전사 및 교정
zh_hans: 字幕打轴、转写与校准
zh_hant: 字幕打軸、轉寫與校準

source: Subtitle Translation Assistant
ar: مساعد ترجمة الترجمة
ja: 字幕翻訳アシスタント
ko: 자막 번역 도우미
zh_hans: 字幕翻译助手
zh_hant: 字幕翻譯助手

# suitable_when_needing_to_approach
source: Suitable when needing to approach the reference software bitrate or control final file size.
ar: مناسب عند الحاجة للاقتراب من معدل بت البرنامج المرجعي أو التحكم في حجم الملف النهائي.
ja: 参照ソフトウェアのビットレートに近づけたい場合や、最終的なファイルサイズを制御したい場合に適しています。
ko: 참조 소프트웨어 비트레이트에 가깝게 하거나 최종 파일 크기를 조절해야 할 때 적합합니다.
zh_hans: 适合需要接近参考软件码率或控制最终文件大小时使用。
zh_hant: 適合需要接近參考軟體碼率或控制最終檔案大小時使用。

# supported_formats_hint
source: Supports SRT, ASS, LRC, WebVTT
ar: يدعم SRT, ASS, LRC, WebVTT
ja: SRT、ASS、LRC、WebVTTをサポート
ko: SRT, ASS, LRC, WebVTT 지원
zh_hans: 支持 SRT、ASS、LRC、WebVTT
zh_hant: 支援 SRT、ASS、LRC、WebVTT

source: System Default / PingFang SC
ar: افتراضي النظام / PingFang SC
ja: システムデフォルト / PingFang SC
ko: 시스템 기본값 / PingFang SC
zh_hans: 系统默认 / PingFang SC
zh_hant: 系統預設 / PingFang SC

# tab_nerd
source: Nerd
ar: خبير
ja: ギーク
ko: 전문가
zh_hans: 极客
zh_hant: 極客

# tab_project
source: Project
ar: المشروع
ja: プロジェクト
ko: 프로젝트
zh_hans: 工程
zh_hant: 工程

source: Tag Group
ar: تحديد المجموعة
ja: グループをマーク
ko: 그룹 태그
zh_hans: 标记分组
zh_hant: 標記分組

source: Target Bitrate
ar: معدل البت المستهدف
ja: ターゲットビットレート
ko: 대상 비트레이트
zh_hans: 目标码率
zh_hant: 目標碼率

source: Target Language
ar: اللغة الهدف
ja: 対象言語
ko: 대상 언어
zh_hans: 目标语言
zh_hant: 目標語言

source: Technical Architecture
ar: البنية التقنية
ja: 技術アーキテクチャ
ko: 기술 아키텍처
zh_hans: 技术架构
zh_hant: 技術架構

source: Temporary Space Occupied
ar: المساحة المؤقتة المستخدمة
ja: 一時的な占有スペース
ko: 임시 점유 공간
zh_hans: 临时占用空间
zh_hant: 臨時佔用空間

source: Text to Speech Settings
ar: إعدادات تحويل النص إلى كلام
ja: テキスト読み上げ設定
ko: 텍스트 음성 변환 설정
zh_hans: 文本转语音设置
zh_hant: 文字轉語音設定

# the_current_dependency_does_not
source: The current dependency does not yet provide the CoreML ForcedAligner inference interface; you can download it as a backup, but please select MLX 4-bit for actual generation.
ar: التبعية الحالية لا توفر واجهة استدلال CoreML ForcedAligner حاليًا؛ يمكن تنزيله كاحتياطي، ولكن يرجى اختيار MLX 4-bit للتوليد الفعلي.
ja: 現在の依存関係はまだCoreML ForcedAligner推論インターフェースを提供していません。バックアップとしてダウンロードできますが、実際の生成にはまずMLX 4-bitを選択してください。
ko: 현재 종속성은 아직 CoreML ForcedAligner 추론 인터페이스를 제공하지 않습니다. 백업으로 다운로드할 수 있지만 실제 생성 시에는 MLX 4-bit를 선택해 주십시오.
zh_hans: 当前依赖暂未提供 CoreML ForcedAligner 推理接口；可下载备用，实际生成请先选 MLX 4-bit。
zh_hant: 當前依賴暫未提供 CoreML ForcedAligner 推理介面；可下載備用，實際生成請先選 MLX 4-bit。

# the_current_media_has_no
source: The current media has no video track.
ar: الوسائط الحالية لا تحتوي على مسار فيديو.
ja: 現在のメディアにはビデオトラックがありません。
ko: 현재 미디어에 비디오 트랙이 없습니다.
zh_hans: 当前媒体没有视频轨道。
zh_hant: 當前媒體沒有影片軌道。

# the_current_project_has_no
source: The current project has no exportable video.
ar: المشروع الحالي لا يحتوي على فيديو قابل للتصدير.
ja: 現在のプロジェクトにはエクスポート可能なビデオがありません。
ko: 현재 프로젝트에 내보낼 수 있는 비디오가 없습니다.
zh_hans: 当前项目没有可导出的视频。
zh_hant: 當前專案沒有可導出的影片。

# the_selected_subtitle_blocks_are
source: The selected subtitle blocks are not consecutive. Please select consecutive blocks to merge.
ar: كتل الترجمة المحددة ليست متتالية. يرجى تحديد كتل متتالية لدمجها
ja: 選択された字幕ブロックが連続していません。結合するには連続した字幕ブロックを選択してください
ko: 선택한 자막 블록이 연속적이지 않습니다. 병합하려면 연속된 자막 블록을 선택하십시오
zh_hans: 选中的字幕块不连续，请选择连续的字幕块进行合并
zh_hant: 選中的字幕塊不連續，請選擇連續的字幕塊進行合併

# the_selected_subtitle_blocks_contain
source: The selected subtitle blocks contain locked items and cannot be merged.
ar: كتل الترجمة المحددة تحتوي على عناصر مقفلة، تعذر الدمج
ja: 選択された字幕ブロックにロックされた項目が含まれているため、結合できません
ko: 선택한 자막 블록에 잠긴 항목이 포함되어 있어 병합할 수 없습니다
zh_hans: 选中的字幕块中包含锁定项目，无法合并
zh_hant: 選中的字幕塊中包含鎖定項目，無法合併

# the_selected_subtitle_blocks_contain_1
source: The selected subtitle blocks contain items with unset times and cannot be merged.
ar: كتل الترجمة المحددة تحتوي على عناصر لم يتم ضبط وقتها، تعذر الدمج
ja: 選択された字幕ブロックに時間が設定されていない項目が含まれているため、結合できません
ko: 선택한 자막 블록에 시간이 설정되지 않은 항목이 포함되어 있어 병합할 수 없습니다
zh_hans: 选中的字幕块中有未设置时间的项目，无法合并
zh_hant: 選中的字幕塊中有未設置時間的項目，無法合併

source: Timeline
ar: خط زمني
ja: タイムライン
ko: 타임라인
zh_hans: 时间轴
zh_hant: 時間軸

# tip_recommend_specific_language_explanation
source: Tip: Recommended to select a specific language for optimized results.
ar: تلميح: يوصى بتحديد لغة معينة للحصول على نتائج محسنة.
ja: ヒント：最適化された結果を得るために、特定の言語を選択することをお勧めします。
ko: 팁: 최적화된 결과를 위해 특정 언어를 선택하는 것이 좋습니다.
zh_hans: 提示：推荐选择特定的语言以获得针对该语种特别优化过的生成效果；如不确定可选择“自动检测”。
zh_hant: 提示：推薦選擇特定的語言以獲得針對該語種特別優化過的生成效果；如不確定可選擇「自動檢測」。

# title_welcome
source: Welcome
ar: مرحبًا
ja: ようこそ
ko: 환영합니다
zh_hans: 欢迎
zh_hant: 歡迎

source: Toggle preview background brightness
ar: تبديل سطوع خلفية المعاينة
ja: プレビュー背景の明るさを切り替え
ko: 미리보기 배경 밝기 전환
zh_hans: 切换预览背景亮度
zh_hant: 切換預覽背景亮度

source: Token Saved
ar: تم حفظ الرمز المميز
ja: トークンが保存されました
ko: 토큰이 저장되었습니다
zh_hans: Token 已保存
zh_hant: Token 已保存

source: Translate Full Sentence
ar: ترجمة جملة كاملة
ja: フルセンテンス翻訳
ko: 전체 문장 번역
zh_hans: 翻译整句
zh_hant: 翻譯整句

source: Translate Subtitles
ar: ترجمة الترجمة
ja: 字幕を翻訳
ko: 자막 번역
zh_hans: 翻译字幕
zh_hant: 翻譯字幕

source: Translation Completed
ar: اكتملت الترجمة
ja: 翻訳が完了しました
ko: 번역 완료
zh_hans: 翻译完成
zh_hant: 翻譯完成

source: Translation Failed
ar: فشلت الترجمة
ja: 翻訳に失敗しました
ko: 번역 실패
zh_hans: 翻译失败
zh_hant: 翻譯失敗

source: Translation Group
ar: مجموعة الترجمة
ja: 翻訳グループ
ko: 번역 그룹
zh_hans: 译文小组
zh_hant: 譯文小組

source: Translation Scope
ar: نطاق الترجمة
ja: 翻訳範囲
ko: 번역 범위
zh_hans: 翻译范围
zh_hant: 翻譯範圍

source: Translation Service
ar: خدمة الترجمة
ja: 翻訳サービス
ko: 번역 서비스
zh_hans: 翻译服务
zh_hant: 翻譯服務

# translation_text
source: Translation
ar: الترجمة
ja: 翻訳
ko: 번역
zh_hans: 译文
zh_hant: 譯文

source: Unable to create AVAssetReader.
ar: تعذر إنشاء AVAssetReader.
ja: AVAssetReaderを作成できません。
ko: AVAssetReader를 생성할 수 없습니다.
zh_hans: 无法创建 AVAssetReader。
zh_hant: 無法創建 AVAssetReader。

source: Unable to create AVAssetWriter.
ar: تعذر إنشاء AVAssetWriter.
ja: AVAssetWriterを作成できません。
ko: AVAssetWriter를 생성할 수 없습니다.
zh_hans: 无法创建 AVAssetWriter。
zh_hant: 無法創建 AVAssetWriter。

# unable_to_create_video_output
source: Unable to create video output pixel buffer pool.
ar: تعذر إنشاء مجمع مخزن مؤقت لبكسل إخراج الفيديو.
ja: ビデオ出力ピクセルバッファプールを作成できません。
ko: 비디오 출력 픽셀 버퍼 풀을 생성할 수 없습니다.
zh_hans: 无法创建视频输出像素缓冲池。
zh_hant: 無法創建影片輸出像素緩衝池。

# unable_to_create_video_output_1
source: Unable to create video output frame.
ar: تعذر إنشاء إطار إخراج الفيديو.
ja: ビデオ出力フレームを作成できません。
ko: 비디오 출력 프레임을 생성할 수 없습니다.
zh_hans: 无法创建视频输出帧。
zh_hant: 無法創建影片輸出幀。

source: Unavailable
ar: غير متاح
ja: 利用不可
ko: 사용 불가
zh_hans: 不可用
zh_hant: 不可用

source: Underline
ar: سطر سفلي
ja: 下線
ko: 밑줄
zh_hans: 下划线
zh_hant: 下劃線

source: Undo
ar: تراجع
ja: 元に戻す
ko: 실행 취소
zh_hans: 撤销
zh_hant: 還原

source: Ungrouped
ar: غير مصنف
ja: 未グループ化
ko: 그룹화되지 않음
zh_hans: 未分组
zh_hant: 未分組

source: Unlock this group
ar: إلغاء قفل هذه المجموعة
ja: このグループをロック解除
ko: 이 그룹 잠금 해제
zh_hans: 解锁此组
zh_hant: 解鎖此組

source: Unnamed Project
ar: مشروع غير مسمى
ja: 無題のプロジェクト
ko: 이름 없는 프로젝트
zh_hans: 未命名项目
zh_hant: 未命名專案

# unsaved_changes_will_be_lost
source: Unsaved changes will be lost if you don’t save.
ar: سيتم فقدان التغييرات غير المحفوظة.
ja: 保存しない場合、編集内容は失われます。
ko: 저장하지 않으면 편집 내용이 손실됩니다.
zh_hans: 如果未保存，编辑的内容将会丢失。
zh_hant: 如果未儲存，編輯的內容將會遺失。

source: Unsupported media file extension
ar: صيغة امتداد ملف الوسائط غير مدعومة
ja: サポートされていないメディアファイルの拡張子です
ko: 지원되지 않는 미디어 파일 확장자입니다
zh_hans: 暂不支持该多媒体文件后缀格式
zh_hant: 暫不支持該多媒體文件後綴格式

# use_the_playhead_as_the
source: Use the playhead as the split point to divide the current subtitle block into two independent blocks
ar: استخدام مؤشر الوقت كنقطة تقسيم لتقسيم كتلة الترجمة الحالية إلى كتلتين مستقلتين
ja: 時間再生ヘッドを分割点として、現在の字幕ブロックを2つの独立したブロックに分割します
ko: 재생 헤드를 분할 지점으로 사용하여 현재 자막 블록을 두 개의 독립된 블록으로 분할합니다
zh_hans: 以时间游标为分割点，将游标所在的字幕块拆分为两个独立字幕块
zh_hant: 以時間遊標為分割點，將遊標所在的字幕塊拆分為兩個獨立字幕塊

# use_voice_activity_detection
source: Use Voice Activity Detection (VAD)
ar: استخدام كشف النشاط الصوتي (VAD)
ja: 音声活動検出 (VAD) を使用する
ko: 음성 활동 감지 (VAD) 사용
zh_hans: 使用 VAD 语音活动检测
zh_hant: 使用 VAD 語音活動檢測

source: Version
ar: الإصدار
ja: バージョン
ko: 버전
zh_hans: 版本
zh_hant: 版本

source: Video Encoding
ar: ترميز الفيديو
ja: ビデオエンコーディング
ko: 비디오 인코딩
zh_hans: 视频编码
zh_hant: 影片編碼

source: Video Stream (Coming Soon)
ar: مجرى الفيديو (قريباً)
ja: ビデオストリーム（近日公開）
ko: 비디오 스트림 (준비 중)
zh_hans: 视频流 (即将推出)
zh_hant: 影片流 (即將推出)

source: Vocal Preprocessing
ar: معالجة أولية للصوت البشري
ja: ボーカル前処理
ko: 보컬 전처리
zh_hans: 人声预处理
zh_hant: 人聲預處理

source: Vocal Separation
ar: عزل الصوت البشري
ja: ボーカル分離
ko: 보컬 분리
zh_hans: 人声分离
zh_hant: 人聲分離

# voice_activity_detection
source: Voice Activity Detection (VAD)
ar: كشف نشاط الصوت (VAD)
ja: 音声活動検出 (VAD)
ko: 음성 활동 감지 (VAD)
zh_hans: 语音活动检测 (VAD)
zh_hant: 語音活動檢測 (VAD)

source: Voice Activity Detection Settings
ar: إعدادات كشف النشاط الصوتي
ja: 音声活動検出設定
ko: 음성 활동 감지 설정
zh_hans: 语音活动检测设置
zh_hant: 語音活動檢測設定

source: What is cached data?
ar: ما هي البيانات المخزنة مؤقتًا؟
ja: キャッシュデータとは何ですか？
ko: 캐시 데이터란 무엇입니까?
zh_hans: 什么是缓存数据？
zh_hant: 什麼是快取資料？

# when_importing_video_or_audio
source: When importing video or audio files, Strophe generates temporary audio transcoding files and waveform analysis cache. This data can significantly speed up waveform rendering and high-speed audio/video scrubbing, but it will occupy your device storage space after use.
ar: عند استيراد ملفات الفيديو أو الصوت، ستقوم Strophe بتوليد ملفات تحويل ترميز الصوت المؤقتة وذاكرة التخزين المؤقت لتحليل شكل الموجة. يمكن لهذه البيانات تسريع عملية عرض شكل الموجة والانتقال السريع للصوت والفيديو بشكل كبير، ولكنها ستشغل مساحة تخزين جهازك بعد الاستخدام.
ja: ビデオやオーディオファイルをインポートする際、Stropheは一時的なオーディオトランスコードファイルと波形分析キャッシュを生成します。これらのデータは、波形のレンダリングや音声・映像の高速シークを大幅に高速化しますが、使用後はデバイスのストレージ容量を占有します。
ko: 비디오 또는 오디오 파일을 가져올 때 Strophe는 임시 오디오 트랜스코딩 파일과 파형 분석 캐시를 생성합니다. 이 데이터는 파형 렌더링 및 초고속 오디오/비디오 탐색 속도를 크게 향상시킬 수 있지만, 사용 후에는 장치의 저장 공간을 차지합니다.
zh_hans: Strophe 在导入视频 or 音频文件时，会生成临时音频转码文件与波形分析缓存。这些数据可以显著加速波形的渲染和音视频的高速跳转，但在使用完毕后，它们会占用您的设备存储空间。
zh_hant: Strophe 在匯入影片 or 音訊檔案時，會生成臨時音訊轉碼檔案與波形分析快取。這些資料可以顯著加速波形的渲染與音視頻的高速跳轉，但在使用完畢後，它們會佔用您的裝置儲存空間。

# app_name
source: Strophe
ja: 活字
zh_hans: 活字
zh_hant: 活字

# strophe_chinese_name
source: Strophe
ja: 活字
ko: 활자
zh_hans: 活字
zh_hant: 活字
